import React from 'react';
import './Dobrodiya.scss';
import { Link } from 'react-router-dom';

export const Dobrodiya = () => {
    return (
        <section className="dobrodiya">
            <div className="dobrodiya__wrapper">
                <h1 className="dobrodiya__title">
                    Добродія
                </h1>

                <p className="dobrodiya__text">
                    Цей розділ створено для того, аби кожен бажаючий міг зробити місто кращим, отримавши винагороду за свою працю. Працює це наступним чином:

                    <ul className="dobrodiya__list">
                        <li>Ми розміщуємо активні оголошення на цій сторінці - прибирання сміття в лісі, латання десятирічної ями на дорозі, висадження дерев, тощо.</li>
                        <li>Кошти на розхідні матеріали та інструмент виділяються з покупок/продажів у розділі <Link to="/store">Магазин</Link>.</li>
                        <li>Винагорода учасникам завдання буде виплачена з поточного балансу у розділі <Link to="/services">Послуги</Link>.</li>
                        <li>Ви можете запропонувати власну ініціативу, або взяти участь у суспільно-громадських роботах.</li>
                        <li>Ми залишаємо за собою право керувати чергою запланованих подій, а також оцінювати вартість робіт - в залежності від терміновості, часу виконання, складності та інших факторів.</li>
                        <li>З часом розділ буде автоматизовано, наскільки це можливо. Проте якщо ви це читаєте, час ще не настав і наші контакти, якщо будуть потрібні, ви знайдете у розділі <Link to="/about">Про нас</Link></li>
                    </ul>

                </p>
            </div>
        </section>
    );
};