import React from 'react';
import './About.scss';
import { Link } from 'react-router-dom';

export const About = () => {
    return (
        <div className="about__wrapper">
            <h1 className="about__title">
                Працюємо на перемогу
            </h1>

            <h2 className='about__subtitle'>
                Наша основна ідея - максимально прозоре закриття потреб військовослужбовців ЗСУ.<br />
                І ось як це відбувається:

                <ul>
                    <li>У розділі <Link to="/store">Магазин</Link> є все, що ви можете замовити і придбати з доставкою</li>
                    <li>Розділ <Link to='/support'>Підтримка ЗСУ</Link> містить інформацію про збори військовим, якими ми займаємося</li>
                    <li>При покупці товарів у магазині, ви можете обрати збір, до якого бажаєте доєднатися</li>
                    <li>Перший збір - пріоритетний, кешбек-кошти та донати будуть залучені до нього, якщо не обрати інше</li>
                    <li>Ви можете просто задонатити - зайти на <Link to="/support">Підтримка ЗСУ</Link> та обрати бажаний збір</li>
                    <li>Ви можете зробити запит на збір, зв'язавшися з нами. Розділ <Link to="/services">Послуги</Link> в розробці.</li>
                    <li>По досягненню 100% збору - предмет потреби купується і відправляється туди, де потрібен</li>
                    <li>Запит на збір видаляється або оновлюється за додаткової потреби</li>
                </ul>
            </h2>
        </div>
    );
}